* Queries against localhost running omero-ontop-mappings
:PROPERTIES:
:ID:       059e06f4-bd2b-4ec1-8280-7c25d62a66fa
:header-args:sparql: :url http://localhost:8080/sparql :cache nil :noweb yes :exports both :eval yes
:mappings: omero-ontop-mappings
:END:
** Prefixes
:PROPERTIES:
:ID:       446e434f-dc84-4edd-b69a-7d96824b853b
:END:
#+name: prefixes
#+begin_src sparql :noweb yes
  PREFIX foaf: <http://xmlns.com/foaf/0.1/>
  PREFIX image: <https://example.org/site/Image/>
  PREFIX dc: <http://purl.org/dc/terms/>
  PREFIX dcterms: <http://purl.org/dc/terms/>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX omecore: <https://ld.openmicroscopy.org/core/>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX omens: <http://www.openmicroscopy.org/ns/default/>
  PREFIX omekg: <https://ld.openmicroscopy.org/omekg#>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX site: <https://example.org/site/>
  PREFIX up: <http://purl.uniprot.org/core/>
  PREFIX uptaxon: <http://purl.uniprot.org/taxonomy/>
  PREFIX vcard: <https://www.w3.org/2006/vcard/ns#>
  PREFIX well: <http://ome.evolbio.mpg.de/Well/>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
#+end_src

#+RESULTS: prefixes
| HTTP/1.1 400                           |                          |
|----------------------------------------+--------------------------|
| Vary: Origin                           |                          |
| Vary: Access-Control-Request-Method    |                          |
| Vary: Access-Control-Request-Headers   |                          |
| Content-Type: text/plain;charset=UTF-8 |                          |
| Content-Length: 171                    |                          |
| Date: Fri                              | 14 Nov 2025 10:44:27 GMT |
| Connection: close                      |                          |
|                                        |                          |
| Encountered "<EOF>" at line 19         | column 47.               |
| Was expecting one of:                  |                          |
| base ...                               |                          |
| prefix ...                             |                          |
| select ...                             |                          |
| construct ...                          |                          |
| describe ...                           |                          |
| ask ...                                |                          |
|                                        |                          |


** SPO
:PROPERTIES:
:ID:       641a4dbb-2590-4db8-a64d-2173554690fd
:END:
#+begin_src sparql
  <<prefixes>>
  select * where {
    ?s ?p ?o .
    }
  limit 10
#+end_src

#+RESULTS:
| s                                                          | p                                               | o                                      |
|------------------------------------------------------------+-------------------------------------------------+----------------------------------------|
| https://ld.openmicroscopy.org/core/light_path              | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://w3id.org/linkml/SlotDefinition |
| https://ld.openmicroscopy.org/core/status                  | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://w3id.org/linkml/SlotDefinition |
| https://ld.openmicroscopy.org/core/stage_label             | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://w3id.org/linkml/SlotDefinition |
| https://ld.openmicroscopy.org/core/position_z              | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://w3id.org/linkml/SlotDefinition |
| https://ld.openmicroscopy.org/core/pump                    | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://w3id.org/linkml/SlotDefinition |
| https://ld.openmicroscopy.org/core/correction              | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://w3id.org/linkml/SlotDefinition |
| https://ld.openmicroscopy.org/core/serial_number           | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://w3id.org/linkml/SlotDefinition |
| https://ld.openmicroscopy.org/core/physical_size_y         | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://w3id.org/linkml/SlotDefinition |
| https://ld.openmicroscopy.org/core/reagent_set_description | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://w3id.org/linkml/SlotDefinition |
| https://ld.openmicroscopy.org/core/co2_percent             | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | https://w3id.org/linkml/SlotDefinition |


** Project
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql
  <<prefixes>>
  select distinct  ?project ?typ where {
  ?project a omecore:Project ;
      rdf:type ?typ ;
  }
  limit 10
#+end_src

#+RESULTS:
| project                            | typ                                        |
|------------------------------------+--------------------------------------------|
| https://example.org/site/Project/1 | https://ld.openmicroscopy.org/core/Project |


** Dataset
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
*** List all datasets
:PROPERTIES:
:ID:       eda1ed27-583d-4637-bc2b-c8795a408c9b
:END:
#+begin_src sparql
  <<prefixes>>
  select ?ds where {
  ?ds a omecore:Dataset .
  }
  limit 10
#+end_src

#+RESULTS:
| ds                                 |
|------------------------------------|
| https://example.org/site/Dataset/1 |
| https://example.org/site/Dataset/2 |
| https://example.org/site/Dataset/3 |


*** datasets and properties
:PROPERTIES:
:ID:       ffeb2f65-35a2-40b6-af88-820caf58ffa8
:END:
#+begin_src sparql
  <<prefixes>>
  select * where {
  ?ds a omecore:Dataset ;
      omecore:experimenter ?owner .
  }
  order by ?owner
#+end_src

#+RESULTS:
| ds                                 | owner                                   |
|------------------------------------+-----------------------------------------|
| https://example.org/site/Dataset/1 | https://example.org/site/Experimenter/0 |
| https://example.org/site/Dataset/2 | https://example.org/site/Experimenter/0 |
| https://example.org/site/Dataset/3 | https://example.org/site/Experimenter/0 |


** Dataset II
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql

  <<prefixes>>
  select distinct * where {
  ?ds a omecore:Dataset .
  ?ds ?prop ?value .
  }
#+end_src

#+RESULTS:
| ds                                 | prop                                                     | value                                        |
|------------------------------------+----------------------------------------------------------+----------------------------------------------|
| https://example.org/site/Dataset/1 | http://purl.org/dc/elements/1.1/identifier               | 1                                            |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/contributor                     | Test User                                    |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/1             |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/2             |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/isPartOf                        | https://example.org/site/Project/1           |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/provenance                      | Screenshots                                  |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/subject                         | Test images                                  |
| https://example.org/site/Dataset/1 | https://ld.openmicroscopy.org/core/experimenter          | https://example.org/site/Experimenter/0      |
| https://example.org/site/Dataset/1 | https://ld.openmicroscopy.org/core/experimenter_group    | https://example.org/site/ExperimenterGroup/0 |
| https://example.org/site/Dataset/1 | https://ld.openmicroscopy.org/omekg#tag_annotation_value | TestTag                                      |
| https://example.org/site/Dataset/1 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type          | https://ld.openmicroscopy.org/core/Dataset   |
| https://example.org/site/Dataset/1 | http://www.w3.org/2000/01/rdf-schema#label               | Dataset 1                                    |
| https://example.org/site/Dataset/2 | http://purl.org/dc/elements/1.1/identifier               | 2                                            |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/contributor                     | Test User                                    |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/11            |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/12            |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/3             |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/4             |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/5             |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/6             |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/7             |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/isPartOf                        | https://example.org/site/Project/1           |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/provenance                      | Screenshots                                  |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/subject                         | Test images                                  |
| https://example.org/site/Dataset/2 | https://ld.openmicroscopy.org/core/experimenter          | https://example.org/site/Experimenter/0      |
| https://example.org/site/Dataset/2 | https://ld.openmicroscopy.org/core/experimenter_group    | https://example.org/site/ExperimenterGroup/0 |
| https://example.org/site/Dataset/2 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type          | https://ld.openmicroscopy.org/core/Dataset   |
| https://example.org/site/Dataset/2 | http://www.w3.org/2000/01/rdf-schema#label               | Dataset 2                                    |
| https://example.org/site/Dataset/3 | http://purl.org/dc/elements/1.1/identifier               | 3                                            |
| https://example.org/site/Dataset/3 | http://purl.org/dc/terms/contributor                     | Caligula                                     |
| https://example.org/site/Dataset/3 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/10            |
| https://example.org/site/Dataset/3 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/8             |
| https://example.org/site/Dataset/3 | http://purl.org/dc/terms/hasPart                         | https://example.org/site/Image/9             |
| https://example.org/site/Dataset/3 | http://purl.org/dc/terms/isPartOf                        | https://example.org/site/Project/1           |
| https://example.org/site/Dataset/3 | http://purl.org/dc/terms/provenance                      | Screenshots                                  |
| https://example.org/site/Dataset/3 | http://purl.org/dc/terms/subject                         | OMERO Mapping                                |
| https://example.org/site/Dataset/3 | https://ld.openmicroscopy.org/core/experimenter          | https://example.org/site/Experimenter/0      |
| https://example.org/site/Dataset/3 | https://ld.openmicroscopy.org/core/experimenter_group    | https://example.org/site/ExperimenterGroup/0 |
| https://example.org/site/Dataset/3 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type          | https://ld.openmicroscopy.org/core/Dataset   |
| https://example.org/site/Dataset/3 | http://www.w3.org/2000/01/rdf-schema#label               | Dataset 3                                    |


** Project Dataset Image hierarchy
:PROPERTIES:
:ID:       9a7fae93-80a0-4cf9-b889-a60113b9bf01
:END:
#+begin_src sparql

  <<prefixes>>
  SELECT distinct *  WHERE {
      ?project a omecore:Project ;
                dcterms:hasPart ?dataset .
      ?dataset a omecore:Dataset ;
                dcterms:hasPart ?image .
      ?image a omecore:Image ;
              rdfs:label ?image_name .
  }
#+end_src

#+RESULTS:
| project                            | dataset                            | image                             | image_name                                 |
|------------------------------------+------------------------------------+-----------------------------------+--------------------------------------------|
| https://example.org/site/Project/1 | https://example.org/site/Dataset/1 | https://example.org/site/Image/2  | 2024-10-10_14-53-28_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/1 | https://example.org/site/Image/1  | 2024-10-10_14-58-36_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/6  | 2024-10-10_15-01-36_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/5  | 2024-10-10_15-07-18_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/4  | 2024-10-10_15-09-28_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/7  | 2024-10-10_15-17-25_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/3  | 2024-10-10_15-28-16_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/11 | 2024-10-10_15-28-16_screenshot.png.ome.tif |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/9  | 2024-10-10_16-39-27_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/10 | 2024-10-10_16-42-47_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/8  | 2024-10-10_16-47-01_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/12 | image_6_with_roi.ome.tif                   |


** Image with owner
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql
  <<prefixes>>
  select distinct * where {
  ?ds a omecore:Image ;
      omecore:experimenter ?owner .
  }
#+end_src

#+RESULTS:
| ds                                | owner                                   |
|-----------------------------------+-----------------------------------------|
| https://example.org/site/Image/1  | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/10 | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/11 | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/12 | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/2  | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/3  | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/4  | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/5  | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/6  | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/7  | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/8  | https://example.org/site/Experimenter/0 |
| https://example.org/site/Image/9  | https://example.org/site/Experimenter/0 |



** Image and DC metadata terms
:PROPERTIES:
:ID:       f9c6719d-7aad-460a-8200-def2533884dd
:END:
#+begin_src sparql

  <<prefixes>>
  SELECT distinct ?img ?author ?subject WHERE {
    ?img a omecore:Image;
         dc:contributor ?author;
         dc:subject ?subject .
    }
#+end_src

#+RESULTS:
| img                               | author    | subject  |
|-----------------------------------+-----------+----------|
| https://example.org/site/Image/1  | Test User | Unittest |
| https://example.org/site/Image/2  | Test User | Unittest |
| https://example.org/site/Image/3  | Test User | Unittest |
| https://example.org/site/Image/4  | Test User | Unittest |
| https://example.org/site/Image/5  | Test User | Unittest |
| https://example.org/site/Image/6  | Test User | Unittest |
| https://example.org/site/Image/7  | Test User | Unittest |
| https://example.org/site/Image/8  | Test User | Unittest |
| https://example.org/site/Image/9  | Test User | Unittest |
| https://example.org/site/Image/10 | Test User | Unittest |
| https://example.org/site/Image/11 | Test User | Unittest |
| https://example.org/site/Image/12 | Test User | Unittest |



** Image properties
:PROPERTIES:
:ID:       5fd7fb92-7286-4fb7-bb0b-e34962e20957
:END:
#+begin_src sparql
  <<prefixes>>
  SELECT distinct ?prop ?val WHERE {
    image:1 ?prop ?val .
    }
  order by ?val
#+end_src

#+RESULTS:
| prop                                                     | val                                          |
|----------------------------------------------------------+----------------------------------------------|
| http://purl.org/dc/terms/isPartOf                        | https://example.org/site/Dataset/1           |
| https://ld.openmicroscopy.org/core/experimenter          | https://example.org/site/Experimenter/0      |
| https://ld.openmicroscopy.org/core/experimenter_group    | https://example.org/site/ExperimenterGroup/0 |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type          | https://ld.openmicroscopy.org/core/Image     |
| http://www.w3.org/2000/01/rdf-schema#label               | 2024-10-10_14-58-36_screenshot.png           |
| http://www.openmicroscopy.org/ns/default/fooZZbar        | bar                                          |
| http://www.openmicroscopy.org/ns/default/ZZZZfooZZZZbar  | cool                                         |
| https://ld.openmicroscopy.org/omekg#tag_annotation_value | Screenshot                                   |
| http://www.openmicroscopy.org/ns/default/ZZbarZZba       | some**thing                                  |
| http://purl.org/dc/terms/contributor                     | Test User                                    |
| http://purl.org/dc/terms/date                            | Thu Sep 11 11:49:01 AM CEST 2025             |
| http://purl.org/dc/terms/subject                         | Unittest                                     |
| http://purl.org/dc/elements/1.1/identifier               | 1                                            |

** Dataset type relations
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql
  <<prefixes>>
      select ?s ?tp  where {
          ?s a omecore:Dataset;
              a ?tp .
  }
  order by ?tp
#+end_src

#+RESULTS:
| s                                  | tp                                         |
|------------------------------------+--------------------------------------------|
| https://example.org/site/Dataset/1 | https://ld.openmicroscopy.org/core/Dataset |
| https://example.org/site/Dataset/2 | https://ld.openmicroscopy.org/core/Dataset |
| https://example.org/site/Dataset/3 | https://ld.openmicroscopy.org/core/Dataset |


** Dataset number of type relations
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql
  <<prefixes>>
      select (count(distinct ?tp) as ?n_types) where {
          ?s a omecore:Dataset;
              a ?tp .
  }

#+end_src

#+RESULTS:
| n_types |
|---------|
|       1 |

** Count number of images in datasets.
:PROPERTIES:
:ID:       9f3ccdc1-85b7-4cf4-a3fb-8a34401b96b5
:END:
#+begin_src sparql
  <<prefixes>>
  SELECT ?dataset (count(distinct ?img) as ?Nimg) 
  WHERE {
    ?img a omecore:Image ;
         ^omecore:image ?dataset . # Uses inverse property.
    ?dataset a omecore:Dataset .
  }
  group by ?dataset
  order by desc(?Nimg) # Descending sort by number of images.
#+end_src

#+RESULTS:
| dataset | Nimg |
|---------+------|



** Number of projects, datasets, images
:PROPERTIES:
:ID:       b8d9a7e6-cb6f-46a3-a198-f8a57a3e81ba
:END:
#+begin_src sparql

  <<prefixes>>
  select ?n_projects ?n_datasets ?n_images where {
    {
      select (count(?project) as ?n_projects) where {
        ?project a omecore:Project .
      }
    }
    {
      select (count(?dataset) as ?n_datasets) where {
        ?dataset a omecore:Dataset .
      }
    }
    {
      select (count(?image) as ?n_images) where {
        ?image a omecore:Image .
      }
    }
  }
#+end_src

#+RESULTS:
| n_projects | n_datasets | n_images |
|------------+------------+----------|
|          1 |          3 |       12 |


** Project and contained datasets
:PROPERTIES:
:ID:       9114c7b4-6367-43f6-a8d2-9583999e554f
:END:
#+begin_src sparql

  <<prefixes>>
    select * where {
    ?proj a omecore:Project ;
             rdfs:label ?lbl .
    ?ds a omecore:Dataset .
    ?proj omecore:dataset ?ds .
    }
  limit 20
#+end_src

#+RESULTS:
| proj | lbl | ds |
|------+-----+----|


** Project with datasets and images
:PROPERTIES:
:ID:       9114c7b4-6367-43f6-a8d2-9583999e554f
:END:
#+begin_src sparql

  <<prefixes>>
    select distinct * where {
    ?proj a omecore:Project ;
      omecore:dataset ?dataset .
    ?dataset a omecore:Dataset ;
      omecore:image ?image .
    ?image a omecore:Image ;
      rdfs:label ?name .
    }
  order by ?image ?dataset ?proj
  limit 20

#+end_src

#+RESULTS:
| proj | dataset | image | name |
|------+---------+-------+------|


** Dataset subject as per map annotation, queried by namespace:key concatenation (dc:subject)
:PROPERTIES:
:ID:       39bce638-19c5-4ed5-9428-7bfdbdc64b72
:END:
#+begin_src sparql
  <<prefixes>>
  SELECT distinct ?ds ?subject WHERE {
      ?ds a omecore:Dataset;
           dc:subject ?subject .
   }
  order by ?img
#+end_src

#+RESULTS:
| ds                                 | subject       |
|------------------------------------+---------------|
| https://example.org/site/Dataset/1 | Test images   |
| https://example.org/site/Dataset/2 | Test images   |
| https://example.org/site/Dataset/3 | OMERO Mapping |


** Images and (optional) tags
:PROPERTIES:
:ID:       3fb29f13-6b99-4d93-9757-7b6d90a40e93
:END:

#+begin_src sparql


  <<prefixes>>
  SELECT distinct ?img ?tag WHERE {
      ?img a omecore:Image.
      ?img omekg:tag_annotation_value ?tag .
   }
#+end_src

#+RESULTS:
| img                               | tag        |
|-----------------------------------+------------|
| https://example.org/site/Image/1  | Screenshot |
| https://example.org/site/Image/2  | Screenshot |
| https://example.org/site/Image/3  | Screenshot |
| https://example.org/site/Image/4  | Screenshot |
| https://example.org/site/Image/5  | Screenshot |
| https://example.org/site/Image/6  | Screenshot |
| https://example.org/site/Image/7  | Screenshot |
| https://example.org/site/Image/8  | Screenshot |
| https://example.org/site/Image/9  | Screenshot |
| https://example.org/site/Image/10 | Screenshot |
| https://example.org/site/Image/11 | Screenshot |
| https://example.org/site/Image/12 | Screenshot |


** Tagged dataset
:PROPERTIES:
:ID:       5ccad4e1-5090-438e-b90c-ede0bd3356bc
:END:

Find all datasets tagged "TestTag".

#+begin_src sparql


  <<prefixes>>
  SELECT distinct ?ds ?name ?tag WHERE {
    ?ds a omecore:Dataset;
        omekg:tag_annotation_value ?tag .
    filter(regex(?tag, "^TestTag$"))
    ?ds rdfs:label ?name .
   }
  order by ?img
#+end_src

#+RESULTS:
| ds                                 | name      | tag     |
|------------------------------------+-----------+---------|
| https://example.org/site/Dataset/1 | Dataset 1 | TestTag |





** Property with default namespace
:PROPERTIES:
:ID:       f538ab93-67f7-4a3e-aa6e-9b6d82e2f99c
:END:

#+begin_src sparql

  <<prefixes>>
  SELECT DISTINCT * WHERE {
    image:11 omens:sampletype ?val.
   }
#+end_src

#+RESULTS:
| val    |
|--------|
| screen |


** Image 9 MouseCT/Skyscan/System namespace
:PROPERTIES:
:ID:       d2ec4a2a-806a-45ae-95a0-3b36d16aa030
:END:
#+begin_src sparql

  <<prefixes>>
  SELECT DISTINCT * WHERE {
    image:9 ?prop ?val .
   }
#+end_src

#+RESULTS:
| prop                                                     | val                                          |
|----------------------------------------------------------+----------------------------------------------|
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type          | https://ld.openmicroscopy.org/core/Image     |
| https://ld.openmicroscopy.org/core/experimenter_group    | https://example.org/site/ExperimenterGroup/0 |
| https://ld.openmicroscopy.org/core/experimenter          | https://example.org/site/Experimenter/0      |
| http://purl.org/dc/terms/date                            | Thu Sep 11 11:49:26 AM CEST 2025             |
| https://ld.openmicroscopy.org/omekg#tag_annotation_value | Screenshot                                   |
| http://purl.org/dc/elements/1.1/identifier               | 9                                            |
| http://www.w3.org/2000/01/rdf-schema#label               | 2024-10-10_16-39-27_screenshot.png           |
| http://purl.org/dc/terms/contributor                     | Test User                                    |
| http://purl.org/dc/terms/subject                         | Unittest                                     |
| http://www.openmicroscopy.org/ns/default/Assay           | Bruker                                       |



** Owners and Groups
:PROPERTIES:
:ID:       83f91f9d-a78e-44a0-ae4c-f24046beaa26
:END:

#+begin_src sparql

  <<prefixes>>
  SELECT distinct * WHERE {
      ?s a omecore:Project ;
  omecore:experimenter ?owner;
  omecore:experimenter_group ?group .
  }
 #+end_src

 #+RESULTS:
 | s                                  | owner                                   | group                                        |
 |------------------------------------+-----------------------------------------+----------------------------------------------|
 | https://example.org/site/Project/1 | https://example.org/site/Experimenter/0 | https://example.org/site/ExperimenterGroup/0 |


#+begin_src sparql :url http://localhost:8080/sparql

  <<prefixes>>
  SELECT distinct ?group ?name WHERE {
    ?group a omekg:Group;
            foaf:name ?name .
    }
 #+end_src

 #+RESULTS:
 | group | name |
 |-------+------|


** HCS objects
:PROPERTIES:
:ID:       07aeeb4f-d827-4bb6-af03-564f3c23bbbd
:END:
*** Plates and screens
:PROPERTIES:
:ID:       1b78f988-ab2e-47ca-a7a5-d389f2190240
:END:
#+begin_src sparql
  <<prefixes>>

  select * where {
    ?screen a omecore:Screen .
    ?plate a omecore:Plate .
    }
  limit 10
#+end_src

#+RESULTS:
| screen                            | plate                            |
|-----------------------------------+----------------------------------|
| https://example.org/site/Screen/1 | https://example.org/site/Plate/1 |
*** WellSample
:PROPERTIES:
:ID:       5a903ef3-9779-4702-ae88-3a82f50b1d42
:END:
#+begin_src sparql
  <<prefixes>>
  select * where {
            ?wellsample a omecore:WellSample ;
                        dcterms:relation ?related_obj .
            ?related_obj a omecore:PlateAcquisition .
        }
  limit 10
#+end_src

#+RESULTS:
| wellsample                             | related_obj                                 |
|----------------------------------------+---------------------------------------------|
| https://example.org/site/WellSample/1  | https://example.org/site/PlateAcquisition/1 |
| https://example.org/site/WellSample/2  | https://example.org/site/PlateAcquisition/1 |
| https://example.org/site/WellSample/3  | https://example.org/site/PlateAcquisition/1 |
| https://example.org/site/WellSample/4  | https://example.org/site/PlateAcquisition/1 |
| https://example.org/site/WellSample/5  | https://example.org/site/PlateAcquisition/1 |
| https://example.org/site/WellSample/6  | https://example.org/site/PlateAcquisition/1 |
| https://example.org/site/WellSample/7  | https://example.org/site/PlateAcquisition/1 |
| https://example.org/site/WellSample/8  | https://example.org/site/PlateAcquisition/1 |
| https://example.org/site/WellSample/9  | https://example.org/site/PlateAcquisition/1 |
| https://example.org/site/WellSample/10 | https://example.org/site/PlateAcquisition/1 |

** Federated query against ome and taxonomy database with HCS objects
:PROPERTIES:
:ID:       94881a24-726a-40ee-b931-d46a8e31a2f1
:END:

#+begin_src sparql :url http://localhost:8080/sparql

  <<prefixes>>
  SELECT distinct * WHERE {
    ?well a omecore:Well ;
    <http://www.openmicroscopy.org/ns/default/TermSource1Accession> ?taxid.

    bind(strafter(?taxid, 'NCBITaxon_') as ?taxon_id)
    bind(iri(concat("http://purl.uniprot.org/taxonomy/", ?taxon_id)) as ?up_taxon)

  # service <https://sparql.uniprot.org/sparql> {
  #   ?up_taxon ?prop ?val .
  # }
  }
  limit 10
 #+end_src

 #+RESULTS:
 | well | taxid | taxon_id | up_taxon |
 |------+-------+----------+----------|

#+begin_src sparql :url https://sparql.uniprot.org/sparql :async yes
  <<prefixes>>
  SELECT *
  FROM <http://sparql.uniprot.org/taxonomy>
  WHERE
  {
     <http://purl.uniprot.org/taxonomy/9606> up:mnemonic ?mnemonic;
                                             ^up:host ?parasite .
    ?parasite up:scientificName ?parasite_name .
  }
  limit 100
#+end_src

#+RESULTS:
| mnemonic | parasite                                 | parasite_name                                                               |
|----------+------------------------------------------+-----------------------------------------------------------------------------|
| HUMAN    | http://purl.uniprot.org/taxonomy/1001061 | Ljunganvirus 1                                                              |
| HUMAN    | http://purl.uniprot.org/taxonomy/100673  | Influenza C virus (strain C/Johannesburg/1/1966)                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/100834  | Influenza A virus (strain A/Chicken/Hong Kong/220/1997 H5N1 genotype Gs/Gd) |
| HUMAN    | http://purl.uniprot.org/taxonomy/10243   | Cowpox virus                                                                |
| HUMAN    | http://purl.uniprot.org/taxonomy/10244   | Monkeypox virus                                                             |
| HUMAN    | http://purl.uniprot.org/taxonomy/10246   | Vaccinia virus (strain LC16m0)                                              |
| HUMAN    | http://purl.uniprot.org/taxonomy/10247   | Vaccinia virus (strain WR 65-16)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/10248   | Vaccinia virus (strain LC16m8)                                              |
| HUMAN    | http://purl.uniprot.org/taxonomy/10249   | Vaccinia virus (strain Copenhagen)                                          |
| HUMAN    | http://purl.uniprot.org/taxonomy/10250   | Vaccinia virus (strain Dairen I)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/10251   | Vaccinia virus (strain IHD-J)                                               |
| HUMAN    | http://purl.uniprot.org/taxonomy/10252   | Vaccinia virus (strain Lister)                                              |
| HUMAN    | http://purl.uniprot.org/taxonomy/10253   | Vaccinia virus (strain Tian Tan)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/10255   | Variola virus                                                               |
| HUMAN    | http://purl.uniprot.org/taxonomy/10258   | Orf virus                                                                   |
| HUMAN    | http://purl.uniprot.org/taxonomy/10259   | Orf virus (strain NZ2)                                                      |
| HUMAN    | http://purl.uniprot.org/taxonomy/10280   | Molluscum contagiosum virus subtype 1                                       |
| HUMAN    | http://purl.uniprot.org/taxonomy/10281   | Molluscum contagiosum virus subtype 2                                       |
| HUMAN    | http://purl.uniprot.org/taxonomy/10298   | Human herpesvirus 1                                                         |
| HUMAN    | http://purl.uniprot.org/taxonomy/10299   | Human herpesvirus 1 (strain 17)                                             |
| HUMAN    | http://purl.uniprot.org/taxonomy/10300   | Human herpesvirus 1 (strain A44)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/10301   | Human herpesvirus 1 (strain Angelotti)                                      |
| HUMAN    | http://purl.uniprot.org/taxonomy/10302   | Human herpesvirus 1 (strain CL101)                                          |
| HUMAN    | http://purl.uniprot.org/taxonomy/10303   | Human herpesvirus 1 (strain HFEM)                                           |
| HUMAN    | http://purl.uniprot.org/taxonomy/10304   | Human herpesvirus 1 (strain F)                                              |
| HUMAN    | http://purl.uniprot.org/taxonomy/10305   | Human herpesvirus 1 (strain HZT)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/10306   | Human herpesvirus 1 (strain KOS)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/10307   | Human herpesvirus 1 (strain MP)                                             |
| HUMAN    | http://purl.uniprot.org/taxonomy/10308   | Human herpesvirus 1 (strain Patton)                                         |
| HUMAN    | http://purl.uniprot.org/taxonomy/10309   | Human herpesvirus 1 (strain SC16)                                           |
| HUMAN    | http://purl.uniprot.org/taxonomy/10310   | Human herpesvirus 2                                                         |
| HUMAN    | http://purl.uniprot.org/taxonomy/10312   | Human herpesvirus 2 (strain 186)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/10313   | Human herpesvirus 2 (strain 333)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/10314   | Human herpesvirus 2 (strain G)                                              |
| HUMAN    | http://purl.uniprot.org/taxonomy/10315   | Human herpesvirus 2 (strain HG52)                                           |
| HUMAN    | http://purl.uniprot.org/taxonomy/10316   | Herpes simplex virus type 2 (strain SA8)                                    |
| HUMAN    | http://purl.uniprot.org/taxonomy/10325   | Cercopithecine herpesvirus 1                                                |
| HUMAN    | http://purl.uniprot.org/taxonomy/10335   | Human herpesvirus 3                                                         |
| HUMAN    | http://purl.uniprot.org/taxonomy/10338   | Varicella-zoster virus (strain Dumas)                                       |
| HUMAN    | http://purl.uniprot.org/taxonomy/10359   | Human cytomegalovirus                                                       |
| HUMAN    | http://purl.uniprot.org/taxonomy/10360   | Human cytomegalovirus (strain AD169)                                        |
| HUMAN    | http://purl.uniprot.org/taxonomy/10362   | Human cytomegalovirus (strain Eisenhardt)                                   |
| HUMAN    | http://purl.uniprot.org/taxonomy/10363   | Human cytomegalovirus (strain Towne)                                        |
| HUMAN    | http://purl.uniprot.org/taxonomy/10369   | Human herpesvirus 6A (strain GS)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/10370   | Human herpesvirus 6A (strain Uganda-1102)                                   |
| HUMAN    | http://purl.uniprot.org/taxonomy/10376   | Epstein-Barr virus (strain GD1)                                             |
| HUMAN    | http://purl.uniprot.org/taxonomy/10377   | Epstein-Barr virus (strain B95-8)                                           |
| HUMAN    | http://purl.uniprot.org/taxonomy/10378   | Epstein-Barr virus (strain Raji)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/103902  | Coxsackievirus B1 (strain Japan)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/103903  | Coxsackievirus B3 (strain Nancy)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/103904  | Coxsackievirus B3 (strain Woodruff)                                         |
| HUMAN    | http://purl.uniprot.org/taxonomy/103905  | Coxsackievirus B4 (strain E2)                                               |
| HUMAN    | http://purl.uniprot.org/taxonomy/103906  | Coxsackievirus B4 (strain JVB / Benschoten / New York/51)                   |
| HUMAN    | http://purl.uniprot.org/taxonomy/103907  | Coxsackievirus B5 (strain Peterborough / 1954/UK/85)                        |
| HUMAN    | http://purl.uniprot.org/taxonomy/103908  | Echovirus 1 (strain Human/Egypt/Farouk/1951)                                |
| HUMAN    | http://purl.uniprot.org/taxonomy/103909  | Echovirus 12 (strain Travis)                                                |
| HUMAN    | http://purl.uniprot.org/taxonomy/103910  | Echovirus 16 (strain Harrington)                                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/103911  | Human parechovirus 1 (strain Harris)                                        |
| HUMAN    | http://purl.uniprot.org/taxonomy/103913  | Echovirus 6 (strain Charles)                                                |
| HUMAN    | http://purl.uniprot.org/taxonomy/103914  | Echovirus 9 (strain Barty)                                                  |
| HUMAN    | http://purl.uniprot.org/taxonomy/103915  | Echovirus 9 (strain Hill)                                                   |
| HUMAN    | http://purl.uniprot.org/taxonomy/103921  | Human herpesvirus 2 (strain B4327UR)                                        |
| HUMAN    | http://purl.uniprot.org/taxonomy/103922  | Human enterovirus 71 (strain 7423/MS/87)                                    |
| HUMAN    | http://purl.uniprot.org/taxonomy/103929  | Rabies virus (strain Pasteur vaccins / PV)                                  |
| HUMAN    | http://purl.uniprot.org/taxonomy/10407   | Hepatitis B virus                                                           |
| HUMAN    | http://purl.uniprot.org/taxonomy/10409   | Hepatitis B virus genotype C subtype adr (strain Japan/adr4/1983)           |
| HUMAN    | http://purl.uniprot.org/taxonomy/10410   | Hepatitis B virus genotype A2 subtype adw2 (isolate Germany/991/1990)       |
| HUMAN    | http://purl.uniprot.org/taxonomy/10411   | Hepatitis B virus genotype D (isolate France/alpha1/1989)                   |
| HUMAN    | http://purl.uniprot.org/taxonomy/10412   | Hepatitis B virus genotype B2 (isolate Indonesia/pIDW420/1988)              |
| HUMAN    | http://purl.uniprot.org/taxonomy/10413   | Hepatitis B virus genotype B1 subtype adw (isolate Japan/pJDW233/1988)      |
| HUMAN    | http://purl.uniprot.org/taxonomy/10415   | Hepatitis B virus genotype B/C subtype adw (isolate Okinawa/pODW282/1998)   |
| HUMAN    | http://purl.uniprot.org/taxonomy/10419   | Hepatitis B virus genotype D subtype adw (isolate United Kingdom/adyw/1979) |
| HUMAN    | http://purl.uniprot.org/taxonomy/10421   | Hepatitis delta virus genotype II (isolate 7/18/83)                         |
| HUMAN    | http://purl.uniprot.org/taxonomy/10422   | Hepatitis delta virus genotype I (isolate American)                         |
| HUMAN    | http://purl.uniprot.org/taxonomy/10423   | Hepatitis delta virus genotype I (isolate Italian)                          |
| HUMAN    | http://purl.uniprot.org/taxonomy/10424   | Hepatitis delta virus genotype I (isolate Japanese M-1)                     |
| HUMAN    | http://purl.uniprot.org/taxonomy/10425   | Hepatitis delta virus genotype I (isolate Japanese M-2)                     |
| HUMAN    | http://purl.uniprot.org/taxonomy/10426   | Hepatitis delta virus genotype I (isolate Nauru)                            |
| HUMAN    | http://purl.uniprot.org/taxonomy/10427   | Hepatitis delta virus genotype II (isolate Japanese S-1)                    |
| HUMAN    | http://purl.uniprot.org/taxonomy/10428   | Hepatitis delta virus genotype I (isolate Japanese S-2)                     |
| HUMAN    | http://purl.uniprot.org/taxonomy/10515   | Human adenovirus C serotype 2                                               |
| HUMAN    | http://purl.uniprot.org/taxonomy/10519   | Human adenovirus B serotype 7                                               |
| HUMAN    | http://purl.uniprot.org/taxonomy/10522   | Human adenovirus B serotype 35                                              |
| HUMAN    | http://purl.uniprot.org/taxonomy/10524   | Human adenovirus F serotype 41                                              |
| HUMAN    | http://purl.uniprot.org/taxonomy/10527   | Human adenovirus D serotype 9                                               |
| HUMAN    | http://purl.uniprot.org/taxonomy/10528   | Human adenovirus A serotype 18                                              |
| HUMAN    | http://purl.uniprot.org/taxonomy/10529   | Human adenovirus A serotype 31                                              |
| HUMAN    | http://purl.uniprot.org/taxonomy/10533   | Human adenovirus C serotype 1                                               |
| HUMAN    | http://purl.uniprot.org/taxonomy/10534   | Human adenovirus C serotype 6                                               |
| HUMAN    | http://purl.uniprot.org/taxonomy/10573   | Human papillomavirus 13                                                     |
| HUMAN    | http://purl.uniprot.org/taxonomy/10579   | Human papillomavirus type 8                                                 |
| HUMAN    | http://purl.uniprot.org/taxonomy/10580   | Human papillomavirus 11                                                     |
| HUMAN    | http://purl.uniprot.org/taxonomy/10583   | Human papillomavirus type 1                                                 |
| HUMAN    | http://purl.uniprot.org/taxonomy/10584   | Human papillomavirus type 2a                                                |
| HUMAN    | http://purl.uniprot.org/taxonomy/10585   | Human papillomavirus 31                                                     |
| HUMAN    | http://purl.uniprot.org/taxonomy/10586   | Human papillomavirus 33                                                     |
| HUMAN    | http://purl.uniprot.org/taxonomy/10587   | Human papillomavirus 35                                                     |
| HUMAN    | http://purl.uniprot.org/taxonomy/10588   | Human papillomavirus 39                                                     |
| HUMAN    | http://purl.uniprot.org/taxonomy/10589   | Human papillomavirus type 41                                                |
| HUMAN    | http://purl.uniprot.org/taxonomy/10590   | Human papillomavirus 42                                                     |


** Federated query against locally running qlever and uniprot
:PROPERTIES:
:ID:       deea35fd-873a-4a43-983e-6497a8a04163
:END:
:LOGBOOK:
CLOCK: [2025-11-14 Fri 11:52]--[2025-11-14 Fri 12:17] =>  0:25
:END:
#+begin_src sparql :url http://localhost:8888/sparql  :eval no


  <<prefixes>>
  SELECT DISTINCT ?well ?taxon ?host_scientific_name ?guest_organism_scientificname WHERE {
    ?well a omekg:Well ;
          omens:TermSource1Accession ?taxon .
    BIND (IRI(CONCAT(STR(uptaxon:), STRAFTER(?taxon,"NCBITaxon_"))) AS ?host)
    SERVICE <https://sparql.uniprot.org/sparql> {
      ?host up:scientificName ?host_scientific_name;
  	^up:host ?guest_organism .
      ?guest_organism up:scientificName ?guest_organism_scientificname .
    }
  }
  LIMIT 100
#+end_src



